{
  "corpus": [
    "Machine learning has revolutionized the field of artificial intelligence.",
    "Children develop their learning abilities through play and exploration.",
    "The learning curve for this software is quite steep.",
    "Deep learning models require massive amounts of training data.",
    "She has a passion for lifelong learning and personal development.",
    "The learning outcomes of this course are clearly defined.",
    "Reinforcement learning is inspired by behavioral psychology.",
    "His learning style is more visual than auditory.",
    "The learning environment should be safe and supportive.",
    "Online learning platforms have become increasingly popular.",
    "Transfer learning allows models to apply knowledge from one domain to another.",
    "Active learning strategies improve student engagement significantly.",
    "The learning process involves trial and error.",
    "Supervised learning requires labeled datasets for training.",
    "Her learning journey has been both challenging and rewarding.",
    "The learning management system tracks student progress automatically.",
    "Unsupervised learning discovers hidden patterns in data.",
    "Collaborative learning encourages students to work together.",
    "The learning objectives must align with assessment methods.",
    "Meta-learning enables algorithms to learn how to learn.",
    "Experiential learning connects theory with practical application.",
    "The learning disabled students receive additional support services.",
    "Semi-supervised learning combines labeled and unlabeled data.",
    "Personalized learning adapts to individual student needs.",
    "The learning analytics dashboard provides valuable insights.",
    "Federated learning preserves privacy while training models.",
    "Social learning theory emphasizes observation and imitation.",
    "The learning retention rate improves with spaced repetition.",
    "Few-shot learning works with minimal training examples.",
    "Blended learning combines online and in-person instruction.",
    "The learning gap between students has widened during the pandemic.",
    "Continuous learning is essential in today's rapidly changing workplace.",
    "Self-supervised learning has gained traction in recent years.",
    "The learning resources are available in multiple formats.",
    "Adaptive learning technologies adjust difficulty based on performance.",
    "His learning disabilities were diagnosed at an early age.",
    "The learning trajectory shows steady improvement over time.",
    "Ensemble learning combines multiple models for better predictions.",
    "Informal learning happens outside traditional educational settings.",
    "The learning expedition took students to historical landmarks."
  ]
}